In [16]:
import pandas as pd

In [17]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [18]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace= True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [19]:
inputs = df.drop('Survived', axis ='columns')
target = df.Survived

In [20]:
# to make sex column in number we use dummies
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [21]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [22]:
#dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female
inputs.drop(['Sex','male'], axis ='columns',inplace =True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [23]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [24]:
inputs.Age= inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [25]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [26]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [27]:
model.fit(X_train,y_train)

GaussianNB()

In [28]:
model.score(X_test,y_test)

0.8022388059701493

In [32]:
X_test[0:10]

     Pclass        Age      Fare  female
132       3  47.000000   14.5000       1
827       2   1.000000   37.0042       0
763       1  36.000000  120.0000       1
623       3  21.000000    7.8542       0
124       1  54.000000   77.2875       0
655       2  24.000000   73.5000       0
779       1  43.000000  211.3375       1
778       3  29.699118    7.7375       0
430       1  28.000000   26.5500       0
61        1  38.000000   80.0000       1

In [33]:
y_test[0:10]

132    0
827    1
763    1
623    0
124    0
655    0
779    1
778    0
430    1
61     1
Name: Survived, dtype: int64

In [34]:
model.predict(X_test[0:10])

array([1, 0, 1, 0, 1, 0, 1, 0, 0, 1], dtype=int64)

In [35]:
model.predict_proba(X_test[:10])

array([[4.29882261e-01, 5.70117739e-01],
       [7.75742836e-01, 2.24257164e-01],
       [1.86220073e-03, 9.98137799e-01],
       [9.58098215e-01, 4.19017855e-02],
       [3.29602051e-01, 6.70397949e-01],
       [7.56612749e-01, 2.43387251e-01],
       [1.28015228e-07, 9.99999872e-01],
       [9.63585230e-01, 3.64147695e-02],
       [7.21558743e-01, 2.78441257e-01],
       [1.94133219e-02, 9.80586678e-01]])

In [36]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.712     , 0.736     , 0.744     , 0.83870968, 0.73387097])